{
  "_class_name": "Discriminator2D",
  "_diffusers_version": "0.15.0.dev0",
  "attention_blocks": [
    2,
    3
  ],
  "attention_heads": 8,
  "block_out_channels": [
    128,
    256,
    512,
    1024,
    1024
  ],
  "block_repeats": [
    4,
    4,
    4,
    4
  ],
  "downsample_blocks": [
    0,
    1,
    2
  ],
  "embedding_dim": 768,
  "groups": 32,
  "in_channels": 8,
  "mlp_hidden_channels": [
    2048,
    2048,
    2048
  ],
  "mlp_uses_norm": true,
  "out_channels": 1,
  "time_embedding_dim": 128,
  "reduction_type": "AdaptiveReduce",
  "prediction_type": "target"
}
